Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.AnalysisModelJobProperties Property
 Gets or sets the analysis model job properties.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelJobProperties AnalysisModelJobProperties { get; set; }
Public Property AnalysisModelJobProperties As AnalysisModelJobProperties
	Get
	Set
Property Value
Type: AnalysisModelJobProperties
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace